using RoguLikeGame1135.Actions;

namespace RoguLikeGame1135.Creatures
{
    public class Mage : CreatureClass
    {
        public Mage()
        {
            MaxHP = 100;
            Damage = 11;
            Armor = 5;
            CurrentHP = 100;
            Actions.Add(new LightAttackTarget());
            Actions.Add(new MultiAtacktarget());

            Names = new string[] { "Гэндальф", "Мерлин", "Саруман", "Дамблдор", "Волан-де-Морт", "Гарри Поттер", "Гермиона Грейнджер", "Рон Уизли", "Альбус Дамблдор", "Северус Снейп", "Рубеус Хагрид", "Минерва Макгонагалл" };
            SubClass = new string[] { "Волшебник", "Чародей", "Колдун", "Маг", "Некромант", "Заклинатель", "Мистик", "Магистр", "Арканист", "Элементалист", "Иллюзионист", "Пиромант" };
            Nicks = new string[] { "Архимаг", "Повелитель Стихий", "Мастер Иллюзий", "Хранитель Арканы", "Мудрый Колдун", "Провидец", "Заклинатель Бурь", "Огненный Маг", "Ледяной Чародей", "Маг Крови", "Некромант Теней", "Мистик Разума" };
        }
    }
}
